{
  "app": {
    "name": "Zignatures",
    "short_description": "Zignatures fügt intelligente, anpassbare Signaturen zu Zendesk-Tickets hinzu.",
    "long_description": "Zignatures ist eine leistungsstarke Zendesk Support-App, die in der Ticket-Seitenleiste angezeigt wird – sowohl bei neuen als auch bestehenden Tickets – und automatisch eine benutzerdefinierte Signatur hinzufügt, sobald ein Ticket eingereicht wird.\n\n### Überblick\n\nMit Zignatures können Administratoren ganz einfach intelligente, gebrandete Signaturen mit einem vollständig anpassbaren Look & Feel erstellen. Signaturen können aus einfachem Text bestehen, mit von Zendesk unterstütztem HTML erweitert werden oder vollständig mithilfe von Zendesk Dynamic Content und Liquid Syntax angepasst werden. Diese Flexibilität ermöglicht es, nahezu jeden HTML-Code zu verwenden, einschließlich erweiterter IF-ELSE-Bedingungen, um Signaturen dynamisch anzupassen.\n\nZignatures gibt zudem Zendesk Support-Agenten Transparenz und Kontrolle über das Verhalten von Signaturen. Wenn aktiviert, können Agenten die App sehen und entscheiden, ob eine Signatur je nach Kontext des Tickets angewendet oder deaktiviert werden soll.\n\n### Look & Feel\n\n![](https://cl.ly/2R1n0T2H2o35/Image%202018-07-12%20at%201.26.37%20PM.png)\n\n![](https://cl.ly/3e3O3p0M1L3F/Screen%20Recording%202018-07-12%20at%2001.33%20PM.gif)\n\n### Häufige Anwendungsfälle sind:\n\nDynamische Signaturen, die Daten aus Tickets oder Benutzern ziehen (z. B. den Ticket-Gruppennamen in der Signatur anzeigen)\n\nMulti-Brand-Unterstützung mit unterschiedlichen Signaturen pro Marke\n\nBedingte Ausschlüsse, z. B. keine Signatur bei SMS, internen Notizen oder bestimmten Kanälen (z. B. SMS-Antworten überspringen)\n\nErweiterte Branding-Anforderungen, einschließlich benutzerdefinierter Farben, Schriftarten, Layouts und mehr\n\nAuch Marketing- und Branding-Teams können kreativ werden und die Anpassungsmöglichkeiten von Zignatures nutzen, um Produkte zu bewerben, Services hervorzuheben oder einfach positive Stimmung in jeder Interaktion zu verbreiten.\n\n### Datenschutz & Datennutzung:\n\nZignatures läuft vollständig innerhalb des Zendesk Application Frameworks und überträgt, speichert oder teilt keinerlei Daten außerhalb Ihrer Zendesk-Instanz. Es werden keine Kunden- oder Ticketdaten über das hinaus verarbeitet, was zur Erstellung der Signatur erforderlich ist, und keine Daten an externe Server gesendet. Die App hat zudem zusätzliche Sicherheits- und Datenschutzprüfungen mehrerer Kunden erfolgreich bestanden.",
    "installation_instructions": "#### Schritt 1\n\nInstallieren Sie die App und akzeptieren Sie die AGB.\n\n#### Schritt 2\n\nKonfigurieren Sie Text oder HTML der Signatur.\n\nSie können Text, HTML, Zendesk-Platzhalter und Zendesk Dynamic Content verwenden.\n\nUnten sehen Sie ein repräsentatives Beispiel für eine HTML-Signatur.\n\n`<br>--<br><br><span style='font-weight:bold;'>`\n`{{current_user.name}} [{{ticket.account}}]` \n`</span><br><br><span style='color:grey;`\n`font-size:14px;'> <strong>tel:</strong>`\n` {{current_user.phone}} </span><br>`\n`<span style='color:grey;font-size:14px;'>`\n`<strong>email:</strong>`\n` {{current_user.email}}</span><br>`\n`<span style='color:grey;font-size:14px;'>`\n`<strong>www:</strong> `\n`<a href='https://www.zendesk.com/' `\n`target=_blank'>www.zendesk.com</a>`\n`</span><br><br><img class='logo-image'`\n`src='https://d1eipm3vz40hy0.cloudfront.net`\n`/images target=_blank'>www.zendesk.com</a>`\n`width='101' height='19' alt='Zendesk logo`\n`Relationship are complicated'><span></span>`\n\n#### Schritt 3\n\nSichtbarkeit konfigurieren:\n\nApp für Agenten anzeigen – Wenn ausgewählt, können Agenten diese App auf der rechten Seite sehen. Die App informiert die Agenten, ob das Ticket signiert wird oder nicht.\n\nKleines Fragezeichen-Symbol für Zendesk Labs anzeigen – Wenn ausgewählt und die App sichtbar ist, wird ein kleines Fragezeichen-Symbol angezeigt, das ein Modal-Fenster mit dem Zendesk Labs-Hinweis öffnet.\n\n#### Schritt 4\n\nVerhalten konfigurieren:\n\nPrivate Kommentare signieren – Wenn ausgewählt, signiert die App private Kommentare. Andernfalls werden private Kommentare ignoriert.\n\nAgenten können für bestimmte Kommentare entscheiden – Wenn ausgewählt, kann der Agent entscheiden, einen bestimmten Kommentar nicht zu signieren.\n\nAgenten können für alle Kommentare entscheiden – Wenn ausgewählt, kann der Agent entscheiden, keine Kommentare zu signieren.\n\n#### Schritt 5\n\nSpeichern Sie die Einstellungen und aktualisieren Sie die Zendesk-Seiten.\n\nWenn die App korrekt konfiguriert ist, wird die Signatur eingefügt, sobald der Agent auf „Absenden“ klickt.",
    "parameters": {
      "signature_template": {
        "label": "Text oder HTML einer Signatur",

"helpText": "Hinterlege hier die Agenten-Signatur als Text oder HTML. Standard Zendesk Platzhalter sowie Dynamische Inhalte werden unterstützt."
      },
      "show_app_to_agents": {
        "label": "App in Seitenleiste anzeigen",
        "helpText": "Wenn aktiviert kann der Agent die App auf der rechten Seitenleiste einblenden. Die App informiert, ob eine Antwort signiert wird."
      },
      "sign_private_comment": {
        "label": "Signiere auch interne Notizen",
        "helpText": "Sofern selektiert, werden auch interne Notizen signiert. Wenn nicht, werden diese Notizen ignoriert."
      },
      "agents_can_decide_on_comment_signatures": {
        "label": "Wahlmöglichkeit des Agenten für einzelne Antwort (Signatur ja/nein)",
        "helpText": "Sofern selektiert, kann der Agent die Signatur für einen einzelnen Kommentar deaktivieren."
      },
      "agents_can_decide_on_ticket_signatures": {
        "label": "Wahlmöglichkeit für alle Antworten (Signatur ja/nein)",
        "helpText": "Sofern selektiert, kann der Agent für alle Antworten entscheiden, ob eine Signatur ergänzt wird."
      },
      "show_labs_icon": {
        "label": "Zeigen Sie ein kleines Fragezeichen, das sich auf Zendesk Labs bezieht",
        "helpText": "Wenn ausgewählt und App sichtbar ist, wird das kleine Fragezeichensymbol angezeigt. Es öffnet sich das modale Fenster mit Zendesk Labs Disclaimer"
      }
    }
  }
}
