{
  "app": {
    "name": "Zignatures",
    "short_description": "Zignatures добавляет умные, настраиваемые подписи к тикетам Zendesk.",
    "long_description": "Zignatures — это мощное приложение для Zendesk Support, которое отображается на боковой панели тикета — как нового, так и существующего — и автоматически добавляет настраиваемую подпись при отправке тикета.\n\n### Обзор\n\nС помощью Zignatures администраторы могут легко создавать интеллектуальные фирменные подписи с полностью настраиваемым видом и стилем. Подписи могут быть простым текстом, дополненным HTML, поддерживаемым Zendesk, или полностью кастомизированными с использованием Zendesk Dynamic Content и Liquid Syntax. Такая гибкость позволяет использовать практически любой HTML-код, включая сложные условия IF-ELSE, для динамической адаптации подписей.\n\nZignatures также предоставляет агентам Zendesk Support прозрачность и контроль над поведением подписей. Если функция включена, агенты могут видеть приложение и выбирать, применять подпись или отключать её в зависимости от контекста тикета.\n\n### Внешний вид\n\n![](https://cl.ly/2R1n0T2H2o35/Image%202018-07-12%20at%201.26.37%20PM.png)\n\n![](https://cl.ly/3e3O3p0M1L3F/Screen%20Recording%202018-07-12%20at%2001.33%20PM.gif)\n\n### Популярные сценарии использования:\n\nДинамические подписи, которые подставляют данные из тикетов или пользователей (например, отображение имени группы тикета в подписи)\n\nПоддержка нескольких брендов с разными подписями для каждого\n\nУсловные исключения, например, отсутствие подписи для SMS, внутренних заметок или определённых каналов (например, не добавлять подпись в SMS-ответах)\n\nСложные требования к брендингу, включая индивидуальные цвета, шрифты, макеты и многое другое\n\nМаркетинговые и бренд-команды также могут использовать возможности кастомизации Zignatures, чтобы продвигать продукты, выделять услуги или просто делиться позитивом в каждой коммуникации.\n\n### Конфиденциальность и использование данных:\n\nZignatures работает полностью в рамках Zendesk Application Framework и не передаёт, не хранит и не обменивается никакими данными за пределами вашей Zendesk-инстанции. Данные клиентов или тикетов не используются сверх необходимого для формирования подписи, и никакая информация не отправляется на внешние серверы. Приложение также прошло дополнительные проверки безопасности и конфиденциальности у ряда клиентов.",
    "installation_instructions": "#### Шаг 1\n\nУстановите приложение и примите условия использования.\n\n#### Шаг 2\n\nНастройте текст или HTML подписи.\n\nВы можете использовать текст, HTML, заполнители Zendesk и Zendesk Dynamic Content.\n\nНиже приведён пример HTML-подписи:\n\n`<br>--<br><br><span style='font-weight:bold;'>`\n`{{current_user.name}} [{{ticket.account}}]` \n`</span><br><br><span style='color:grey;`\n`font-size:14px;'> <strong>tel:</strong>`\n` {{current_user.phone}} </span><br>`\n`<span style='color:grey;font-size:14px;'>`\n`<strong>email:</strong>`\n` {{current_user.email}}</span><br>`\n`<span style='color:grey;font-size:14px;'>`\n`<strong>www:</strong> `\n`<a href='https://www.zendesk.com/' `\n`target=_blank'>www.zendesk.com</a>`\n`</span><br><br><img class='logo-image'`\n`src='https://d1eipm3vz40hy0.cloudfront.net`\n`/images target=_blank'>www.zendesk.com</a>`\n`width='101' height='19' alt='Zendesk logo`\n`Relationship are complicated'><span></span>`\n\n#### Шаг 3\n\nНастройка видимости:\n\nПоказывать приложение агентам – Если выбрано, агенты смогут видеть приложение в правой части экрана. Приложение информирует агентов, будет ли тикет подписан.\n\nПоказывать маленький значок вопроса для Zendesk Labs – Если выбрано и приложение видно, появится маленький значок вопроса, открывающий модальное окно с предупреждением Zendesk Labs.\n\n#### Шаг 4\n\nНастройка поведения:\n\nПодписывать приватные комментарии – Если выбрано, приложение подписывает приватные комментарии. В противном случае приватные комментарии игнорируются.\n\nАгенты могут выбирать подпись для отдельных комментариев – Если выбрано, агент сможет не подписывать отдельный комментарий.\n\nАгенты могут выбирать подпись для всех комментариев – Если выбрано, агент сможет отказаться от подписания всех комментариев.\n\n#### Шаг 5\n\nСохраните настройки и обновите страницы Zendesk.\n\nЕсли приложение настроено правильно, подпись будет автоматически добавлена, когда агент нажимает кнопку «Отправить».",
    "parameters": {
      "signature_template": {
        "label": "Текст или HTML шаблон подписи",
        "helpText": "Скопируйте сюда текст или HTML шаблон подписи. Возможно использовать стандартные placeholder'ы и Динамический контет"
      },
      "show_app_to_agents": {
        "label": "Показывать приложение агентам",
        "helpText": "Если выбрано то Агенты смогут видеть приложение на панели справа. Приложение информирует агентов о возможной подписи."
      },
      "sign_private_comment": {
        "label": "Подписывать внутренние комментарии",
        "helpText": "Если выбарно приложение будет подписывать внутренние комментарии агентов."
      },
      "agents_can_decide_on_comment_signatures": {
        "label": "Агенты могут подписывать индивидуальные комментарии",
        "helpText": "Если выбрано Агенты будут иметь возможность подписывать индивидуальные комментарии"
      },
      "agents_can_decide_on_ticket_signatures": {
        "label": "Агенты могут подписывать все свои комментарии",
        "helpText": "Если выбрано будут иметь возможность подписывать все свои комментарии"
      },
      "show_labs_icon": {
        "label": "Показать значок с вопросом со ссылкой на Zendesk Labs",
        "helpText": "Если выбрано будет показан значок с вопросом, который открывает модальное окно со ссылкой на Zendesk Labs"
      }
    }
  }
}
